app/controllers/api/v1/tasker_profiles_controller.rb

SELECT COUNT(*) FROM "tasker_profiles" WHERE (avg_rating >= 4.0)
SELECT "users".* FROM "users" WHERE "users"."id" = '6dcadb7a-1de2-4112-9712-e5b3b2860603'
---
      def index
        resources = TaskerProfile.includes(:user, :categories)
        resources = apply_filters(resources)
        resources = apply_sorting(resources)

        total = resources.count
        resources = apply_pagination(resources)

        profiles_data = if distance_filter_active?
          lat = params[:lat].to_f
          lng = params[:lng].to_f
          resources.map do |profile|
            address = profile.user.addresses.default_addresses.first || profile.user.addresses.first