app/services/tasker_profiles/onboarding_service.rb

    def call
      return failure("Tasker profile already exists") if user.tasker_profile.present?
---
SELECT "tasker_profiles".* FROM "tasker_profiles" WHERE "tasker_profiles"."user_id" = '6dcadb7a-1de2-4112-9712-e5b3b2860603' LIMIT 1

    def create_tasker_profile
      @tasker_profile = user.build_tasker_profile(tasker_profile_params)
      @tasker_profile.save!
---
INSERT INTO "tasker_profiles" ("user_id", "bio", "hourly_rate", "allows_instant_booking", "instant_booking_buffer_hours", "availability", "skills", "experience_years", "background_check_status", "background_check_date", "insurance_verified", "avg_rating", "total_tasks_completed", "total_earnings", "response_rate", "response_time_hours", "stripe_account_id", "is_active", "created_at", "updated_at") VALUES ('6dcadb7a-1de2-4112-9712-e5b3b2860603', 'Xadsacsadasdasc asdascascas sadsadasdas adasdsadsa asdasdsadas asdascasdascasdas asdasdasdsadas', 10.0, FALSE, 24, NULL, '[]', 10, 'pending', NULL, FALSE, 0.0, 0, 0.0, 0.0, NULL, NULL, TRUE, '2026-01-25 14:59:31.537181', '2026-01-25 14:59:31.537181') RETURNING "id"

    def associate_categories
      categories = Category.where(id: category_ids)
      @tasker_profile.categories << categories
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = '5d855d93-fde1-4115-bdc5-84f0ecc2eb3b'
INSERT INTO "tasker_profile_categories" ("tasker_profile_id", "category_id", "created_at", "updated_at") VALUES ('3d3047c1-e848-48ac-91f0-5f728f097359', '5d855d93-fde1-4115-bdc5-84f0ecc2eb3b', '2026-01-25 14:59:31.562213', '2026-01-25 14:59:31.562213') RETURNING "id"